export function transliterateToUrl(str: string): string {
  const mapping: { [key: string]: string } = {
    а: "a",
    б: "b",
    в: "v",
    г: "g",
    д: "d",
    е: "e",
    ё: "yo",
    ж: "zh",
    з: "z",
    и: "i",
    й: "y",
    к: "k",
    л: "l",
    м: "m",
    н: "n",
    о: "o",
    п: "p",
    р: "r",
    с: "s",
    т: "t",
    у: "u",
    ф: "f",
    х: "kh",
    ц: "ts",
    ч: "ch",
    ш: "sh",
    щ: "sch",
    ы: "y",
    э: "e",
    ю: "yu",
    я: "ya",
    " ": "-",
    "1": "1",
    "2": "2",
    "3": "3",
    "4": "4",
    "5": "5",
    "6": "6",
    "7": "7",
    "8": "8",
    "9": "9",
    "0": "0",
  };

  return str
    .split("")
    .map((char) => mapping[char.toLowerCase()] || char) // Применение транслитерации
    .join("")
    .toLowerCase() // Приведение результата к нижнему регистру
    .replace(/[^a-z0-9\-]/g, "") // Удаление лишних символов
    .replace(/--+/g, "-") // Удаление повторяющихся дефисов
    .replace(/^-|-$/g, ""); // Удаление дефисов в начале и в конце строки
}
